[{"title": "THE DAY IN PHOTOS: March 12, 2021", "datetime": "Mar 12 11:37 PM", "author": "ABS-CBN News", "article": ""}, {"title": "IBP, NUPL slam police request for names of lawyers representing ‘communist terrorist’ groups", "datetime": "Mar 12 11:22 PM", "author": "ABS-CBN News", "article": "MANILA - The Integrated Bar of the Philippines on Friday slammed an alleged Philippine National Police (PNP) request from a court a for list of lawyers representing members of supposed \"communist-terrorist\" groups in the country.\n\n The Supreme Court earlier said Calbayog Regional Trial Court received the request signed by a certain Police Lt. Fernando Calabria Jr. from the Calbayog City Police Station, but \"no action\" has been done by the said court so far.\n\n \"The letter disregards the very basic principle that lawyers are free and even duty-bound to represent those accused regardless of political or ideological persuasions so that their rights are protected, due process is observed, justice is done, and that the rule of law is upheld. Lawyers therefore should not be suspected, discriminated against, faulted, red-tagged, or attacked for doing their professional duty,\" IBP national president Domingo Egon Cayosa said in a statement.\n\n \"The letter is improper, deplorable, and alarming.\"\n\n Cayosa called on authorities for a comprehensive probe on the request and \"promote state responsibility to ensure that lawyers can do their job without threats, harassment, intimidation, or retribution.\"\n\n \"As we remain vigilant, we trust that Filipino lawyers will remain courageous and steadfast sentinels of the rule of law,\" he said.\n\n The National Union of People's Lawyers (NUPL) also condemned the request. The NULP said the letter shows \"barefaced disregard of the PNP for human rights, particularly the right to access lawyers and legal services.\n\n \"It is an affront to the right and duty of lawyers to exercise their profession without fear as well as the administration of justice,\" the NUPL said in a statement.\n\n \"The police has no right to profile lawyers on the basis of their clients' personalities or ideologies. Under the UN Basic Principles on the Role of Lawyers, lawyers must 'not be identified with their clients or their clients' causes as a result of discharging their functions.' Nevertheless, lawyers, like other citizens, are entitled to freedom of expression, belief, association and assembly. The persecution of lawyers, on account of their functions as officers of the court, simply cannot be tolerated,\" it said.\n\n The union accused the PNP as the \"leading perpetrators of lawlessness and terror\" in the Philippines under the \"murderous regime\" of President Rodrigo Duterte, who came to power in 2016 on a promise to eradicate crime and illegal drug trade through violent means.\n\n \"It was the police that mercilessly killed suspected drug offenders in the tens of thousands and, most recently, nine activists in Southern Tagalog -- tokhang-style -- while allegedly enforcing search warrants for loose firearms. Even the reported assassins of Calbayog City Mayor Ronald Aquino are uniformed police personnel,\" the NUPL said.\n\n The police request came days after Aquino and several others were killed. Authorities claimed it was a shootout between the mayor's men and the police, but a lawmaker, along with Aquino's son, argued it was an ambush by non-uniformed cops.\n\n \"The letter intensifies the atmosphere of fear and repression with which lawyers are trying to perform their sworn duties towards the courts, society, and their clients, regardless of the latter's political beliefs. It has no objective other than to create a virtual hitlist of lawyer targets to be 'neutralized.' Needless to state, it must be rebuffed, even condemned, by the courts,\" the NUPL said.\n\n At least 54 lawyers, judges and prosecutors have been killed during the term of Duterte, the union said, and the PNP's request to get the names of lawyers of CTG members' \"produces a chilling effect\" to legal counsels in the Philippines.\n\n \"We thus reiterate our calls for measures that will ensure that lawyers such as ourselves will be able to perform all of our professional functions without intimidation, hindrance, harassment or improper interference. We also demand that the PNP immediately desist from harassing our colleagues in the legal profession -- lawyers for \"CTG personalities\" or not,\" the NUPL said.\n\n According to Cayosa, the IBP was assured by top PNP officials that there was no directive to Calabria to procure the names of legal counsels.\n\n FROM THE ARCHIVES\n\n"}, {"title": "Vaccination program, baka abutin ng hanggang 2033 dahil sa bagal ayon kay Senator Lacson", "datetime": "Mar 12 11:16 PM", "author": "ABS-CBN News", "article": ""}, {"title": "Bakas ng droga, kapabayaan nakita sa pagkamatay ni Christine Dacera: NBI", "datetime": "Mar 12 11:01 PM", "author": "ABS-CBN News", "article": "MAYNILA - May nakitang bakas ng droga at kapabayaan sa pagkamatay ni Christine Dacera, nang makakita ng ebidensiyang may droga sa kuwarto na tinuluyan ng flight attendant at ng kaniyang mga kaibigan noong New Year’s Eve.\n\n Ito ang lumabas sa isinagawang imbestigasyon ng National Bureau of Investigation (NBI) sa hiling na parallel probe ng pamilya ng flight attendant sa kaso.\n\n Ayon sa NBI Death Investigation Division Agent on Case na si Atty. Zulikha Conales Degamo, may nakitang bakas ng metamphetamine o fluoromethampethamine, o party drugs nang suriin ang bakas ng lugar kung saan sumuka si Dacera, 23, bago siya namatay.\n\n Pinagbasehan din ng NBI ang mga naging salaysay ng mga nakasama nina Dacera sa katabing kuwarto na nakasama pa nina Dacera na mag-party sa City Garden Hotel sa Makati.\n\n Nadiskubre rin na dati nang uminom ng maintenance drugs si Dacera para sa kondisyon niya sa puso.\n\n Bagama’t aneurysm ang naging cause of death, ayon sa mga eksperto ng NBI, posibleng nagpalala sa kaniyang kondisyon ang paggamit ng ilegal na droga.\n\n \"According to our experts na kapag ikaw ay gumamit ng drugs ay tataas ang iyong BP (blood pressure). So magra-rapid ang iyong heartbeat at tataas ang iyong BP, which will ultimately result [in] the rupture of the aneurysm,\" ani Degamo, bagama't hindi tahasang sinabi ng NBI na gumamit ng droga si Dacera.\n\n Disyembre 31 nang mag-book ng hotel room sa City Garden Hotel si Dacera kasama ang kaniyang mga kaibigan para salubungin ang Bagong Taon. Sa Room 2209 ginawa ng magkakaibgan ang pagsalubong, at may mga nakasama rin umano silang mag-party sa katabing kuwarto na Room 2207.\n\n Pagsapit ng madaling araw ay nakaramdam ng pananakit ng ulo si Dacera at kalauna'y nawalan ng malay. Idineklarang patay si Dacera nang dalhin sa ospital.\n\n Lumabas sa imbestigasyon ng PNP na natural causes ang ikinamatay at walang homicide sa nangyari, bagay na tinutulan ng pamilyang Dacera.\n\n Taliwas ang investigation findings ng NBI sa unang pahayag ng mga kaibigan ni Dacera na nagsabing wala namang gumamit sa kanila ng droga. Dahilan ito para magsampa rin ang tanggapan ng obstruction of justice laban sa 8 kaibigan ni Dacera na kasama nito sa kuwarto.\n\n Kasama sa mga sinampahan ng kasong obstruction of justice sina: Mark Rosales, Rommel Galido, John Dela Serna, Gregorio De Guzman, Jezreel Rapinan, Alain Chen, Reymay English, at Darwin Macalla.\n\n Kinasuhan naman si Rosales at Garrido dahil sa pamimigay ng droga. May hiwalay namang kaso si Rosales dahil sa paggamit ng droga.\n\n Pinakakasuhan naman ang apat sa mga kaibigan ni Dacera ng reckless imprudence dahil ilang oras na ang lumipas bago nila ito binigyan ng first aid.\n\n \"Dahil sa kakaunting panahon na kasama ni Tin ang occupants ng Room 2207 ay nakita nila na humihingal at nahihirapan itong huminga, nagsabi pa siyang numb ang kaniyang katawan, masakit ang kaniyang ulo. And yet 'yung occupants ng room 2209 who were with her for such a long time failed to observe the littlest of these details,\" ani Deramo.\n\n Pinakakasuhan naman ng perjury sina Galido, Dela Serna, at De Leon ng perjury, at obstruction of justice si Neptali Maroto kaugnay sa mga binawing salaysay sa pulis, na ayon sa NBI ay walang basehan.\n\n Batay sa naging imbestigasyon, hindi napatunayang ni-rape si Dacera, ayon kay NBI Spokesperson Ferdinand Lavin, dahil wala umano itong mga abrasion o gasgas na nakita sa kaniyang ari at may ihi na nakuha sa kaniyang pantog - taliwas sa naging unang police report na ni-rape ang dalaga.\n\n Masaya naman ang mga abogado ng pamilyang Dacera sa resulta ng imbestigasyon.\n\n \"Redemption para sa amin ito. In spite of the opinion sa social media, 'yung negative na natanggap ng family, ito po samin ay ‘yung bunga ng paghihirap ng NBI, sa pakikipagtulungan nila sa mga ahensiya,\" ani Jose Ledda III, abogado ng pamilya.\n\n Ayon sa NBI, hindi nagbigay ng salaysay ang 9 na kaibigan ni Dacera kahit ilang beses silang inimbita, pero maaari pa rin silang magpaliwanag sa piskal.\n\n Sinubukan din ng ABS-CBN News na kuhanin ang panig ng ilan sa mga kinasuhan pero tumanggi muna sila habang hinihintay nila ang kopya ng isinampang kaso ng NBI.\n\n — Ulat ni Niko Baua, ABS-CBN News\n\n"}, {"title": "Pacquiao nagpatutsada sa kapartido: Unahin ang pandemya bago politika", "datetime": "Mar 12 09:51 PM", "author": "ABS-CBN News", "article": ""}, {"title": "PH embassy sa US nanawagan na paigtingin ang aksiyon vs Asian hate crimes", "datetime": "Mar 12 09:41 PM", "author": "ABS-CBN News", "article": ""}, {"title": "Checking for symptoms", "datetime": "Mar 12 09:32 PM", "author": "Jire Carreon, ABS-CBN News", "article": ""}, {"title": "Police checkpoints ipatutupad sa 'COVID-19 hotspots' sa Kamaynilaan", "datetime": "Mar 12 09:30 PM", "author": "ABS-CBN News", "article": ""}, {"title": "ALAMIN: Kuwento ng magpinsang Dumagat na pinaslang noong 'Bloody Sunday'", "datetime": "Mar 12 08:59 PM", "author": "Mike Navallo, ABS-CBN News", "article": "MAYNILA — Pinuntahan ng Commission on Human Rights (CHR) nitong Biyernes ang pinangyarihan ng pagpatay sa 2 Dumagat tribe members sa Tanay, Rizal noong Linggo, ang tinaguriang \"Bloody Sunday\" ng mga aktibista.\n\n Higit 2 oras ang ibiniyahe at higit 30 minuto pa ang nilakad ng mga kinatawan ng CHR para marating ang Sitio Mina, Barangay Sta. Ines sa Tanay.\n\n Isa si Puroy dela Cruz sa 2 Dumagat na napatay noong linggo sa magkakasabay na operasyon ng mga pulis sa Calabarzon.\n\n Unang nakita ng CHR ang banig na pinagtulugan umano ni Dela Cruz at ng kanyang asawa na tadtad ng tama ng bala ng baril.\n\n Sunod nilang ininspeksiyon ang loob ng bahay ni Dela Cruz kung saan ipinakita kung papaano siya napatay.\n\n Ayon sa mga nakakita, kinaladkad umano palabas ng bahay ang misis at mga anak ni Dela Cruz bago sila nakarinig ng magkasunod na putok ng baril bago mag-alas-4 ng madaling araw.\n\n \"Wala po kami magawa, ano po, nakabantay po sa amin 'yung mga pulis po,\" ani alyas \"Alice,\" kaanak ni Dela Cruz. Nakauniporme pa umano ang mga pulis.\n\n Sa bersiyon ng mga pulis, nanlaban umano si Dela Cruz pero tanong ng mga nakakakilala sa kanya, bakit sa isang bahagi lang ng bahay may tama ng bala ng baril at wala sa kabilang bahagi?\n\n Itinatanggi rin ng mga kamag-anak ni Dela Cruz na may baril ito.\n\n \"Bago po nangyari, noong hapon po, naglinis po kami ng bahay. Inalis po namin mga gamit namin, mga damit po namin. Wala naman pong nakalagay doon,\" sabi ni Alice.\n\n Pinuntahan din ng CHR ang bahay ng pinsan ni Dela Cruz na si Randy dela Cruz sa Sitio Kinabuan sa parehong barangay, na napatay din noong linggo.\n\n Ang mga nakakakilala kina Puroy at Randy, itinatangging rebeldeng komunista ang dalawa.\n\n Sa pangangalakal ng luya at gabi sila nabuhay, at kung minsan, nagtrabaho rin bilang porter na naghahakot ng gamit patawid ng bundok papuntang Quezon para may maipakain sa kani-kanilang mga pamilya.\n\n \"'Yung mga bintang sa amin walang katotohanan,\" sabi ni alyas \"Domeng,\" kakilala ng magpinsan.\n\n \"Siya ay mabuting tao at nabubuhay lang sa pamamagitan ng pangangalakal,\" sabi ni alyas \"Pablo,\" kakilala ni Puroy.\n\n Ang nangyaring patayan noong Linggo, nagdulot umano ng takot sa mga katutubo kaya ang ilan sa kanila, lumikas sa kanilang tinitirhan at pansamantalang naninirahan sa may ilog malapit sa sentro ng barangay.\n\n Sinabi na ni Justice Secretary Menardo Guevarra noong Huwebes na opisyal niyang ieendorso sa inter-agency committee on extra-legal killings ang mga nangyaring patayan noong Linggo.\n\n Suportado raw ito ng Palasyo.\n\n Umaasa naman ang mga Dumagat na mabibigyan ng hustisya ang pagkamatay ng kanilang mga katribu at babalik na sa normal ang kanilang pamumuhay.\n\n"}, {"title": "CBCP puspusan ang paghahanda sa ika-500 anibersaryo ng Kristiyanismo sa Pinas", "datetime": "Mar 12 08:40 PM", "author": "ABS-CBN News", "article": ""}, {"title": "PH gov’t has yet to get cold storage suppliers through bidding due to advance payment prohibition", "datetime": "Mar 12 08:27 PM", "author": "Kristine Sabillo, ABS-CBN News", "article": "MANILA — The Department of Health on Friday revealed that while it has been regularly holding biddings, the country has yet to clinch an agreement with a cold storage facility.\n\n “The bidding has been continuous naman. It has been regular. Ang problema, halos lahat nadisqualify doon sa initial run ng aming procurement kasi may mga requirements kami based on our terms of reference that was not able to be complied with these 3rd party logistics na nag-apply sa amin,” Health Undersecretary Maria Rosario Vergeire said during a briefing.\n\n (The bidding has been continuous. It has been regular. The problem is that almost all were disqualified during the initial run of our procurement because we have a requirement based on the terms of reference that was not complied with the 3rd party logistics applying.)\n\n Vergeire explained that government procurement laws state that they can only provide the payment once the service is rendered or there are receivables already.\n\n “I think because of this big transaction medyo may issue ’yan sa mga nagbi-bid na 3rd party logistics kasi wala pwedeng ibigay na parang advance payment,” she said.\n\n (I think since this is a big transaction the 3rd party logistics companies have an issue with that because they are unable to receive advance payment.)\n\n Vergeire said the department could not change the system since it is part of the law followed when it comes to bidding.\n\n The health official said the DOH currently does not have problems because there is enough capacity in government facilities and that there are groups helping them.\n\n “Tinitignan lang natin, kailangan lang natin maisiguro na meron tayong makuha dahil ’pag dumating na ’yung most of the bulk na ino-order nating bakuna kakailanganin talaga natin itong logistics firm na ito,” she said.\n\n (We just need to ensure that we get one once the bulk orders of vaccines come in because we really need a logistics firm.)\n\n So far, the country has received more than a million vaccines from AstraZeneca and Sinovac. The government, which is expecting more shipments in the coming months, is aiming to inoculate up to 70 million Filipinos, which will require 140 million doses, before the end of the year.\n\n While most vaccines will only require regular refrigerator temperature, messenger RNA vaccines such as that of Pfizer and Moderna, which are both expected to arrive in the Philippines, require ultra cold storage to keep the doses frozen.\n\n"}, {"title": "Human rights groups hold noise barrage to condemn summary killings", "datetime": "Mar 12 08:21 PM", "author": "Jire Carreon, ABS-CBN News", "article": ""}, {"title": "Usad ng pag-roll out ng bakuna kontra COVID-19 pinabibilisan", "datetime": "Mar 12 08:14 PM", "author": "ABS-CBN News", "article": "MAYNILA - Pinabibilisan ng ilan ang pagpapabakuna kontra coronavirus disease (COVID-19) matapos lumabas sa datos ng Department of Health na 11 porsiyento pa lang ng health workers ang nababakunahan.\n\n Hinikayat ni Sen. Panfilo Lacson na bilisan ang pagro-roll out ng mga bakuna dahil kung pagbabasehan umano ang kasalukuyang usad ng pagbabakuna, baka taong 2033 pa maabot ang herd immunity mula sa pagbabakuna ng 70 milyong Pilipino.\n\n \"If we do not improve on this pace, and let’s all hope we will accelerate, we will finish vaccinating the 70 million target population to achieve herd immunity in 2033,\" ani Lacson sa isang pahayag.\n\n Sa datos ng DOH, nasa 11 porsiyento pa lang ng mga health worker ang nabakunahan mula Miyerkoles. Katumbas ito ng nasa 114,615 eligible health workers.\n\n Sa bilang, 101,827 ang naturukan ng Sinovac vaccines mula China, habang 12,788 ang naturukan ng bakuna na gawa ng AstraZeneca. Pinakamarami ang nabakunahan sa Metro Manila at Cordillera Administrative Region.\n\n Matapos ang health workers, tuturukan na rin ng bakuna ang ibang priority sector tulad ng senior citizens, mahihirap, at economic frontliners.\n\n Pero ang ilan, naiinip na.\n\n \"Tayong mahirap diyan. Dapat nga mas maaga sana 'yan. Sa ibang bansa vaccine na, sa atin face shield pa lang,\" ayon sa isang tricycle driver.\n\n \"Hindi ka makalabas. Hindi ka makapagtrabaho. Sa gallery, hindi na pinapasok,\" pahayag naman ng senior citizen na si Virgilio Prontes.\n\n Aminado naman si Health Secretary Francisco Duque III na hindi inaasahan ang pagbagal ng pagbabakuna. Pero ngayon aniya ay bumibilis na ito.\n\n \"The first week, I will admit, the vaccination rate was not as quick as we wanted it, but for obvious reasons. Siyempre nag-uumpisa pa lang,\" ani Duque.\n\n Kinausap na rin ng DOH ang implementing units na maglaan ng mas malaking lugar para sa post-vaccination monitoring.\n\n Sinabi rin ni Duque na ang pagbabakuna ay umaabot ng 20,000 kadao kada araw.\n\n Pero may ilang LGU, gaya ng Maynila, na tumatagal ang usad ng vaccination drive dahil sa paghihintay ng doses ng bakuna mula sa gobyerno.\n\n Sa ngayon, nasa 1.1 milyong COVID-19 vaccines mula sa kailangang 3.4 milyong doses para sa lahat ng health workers ang dumating sa bansa.\n\n Inaasahan namang mapipirmahan ang supply agreement para sa 30 milyong doses ng Novavax COVID-19 vaccine sa pagbalik ni Galvez mula India.\n\n Darating naman sa Marso ang 1 milyong dose ng bakuna ng Sinovac at dagdag na bakuna ng AstraZeneca.\n\n Inaprubahan na rin ng Asian Development Bank ang kabuuang $900 milyon na utang sa pagbili ng Pilipinas ng mga bakuna kontra COVID-19.\n\n — Ulat ni Vivienne Gulla, ABS-CBN News\n\n"}, {"title": "Patuloy na paglobo ng COVID-19 cases ikinaalarma na ng mga opisyal, eksperto", "datetime": "Mar 12 08:06 PM", "author": "ABS-CBN News", "article": "MAYNILA — Habang patuloy na umaakyat ang kaso ng COVID-19 sa bansa, naaalarma na ang Philippine Medical Association na baka bumalik sa dati ang sitwasyon lalo’t may ilang mga doktor ang muling nagkakasakit.\n\n Mismong si Health Secretary Francisco Duque na ang nagsabing nakababahala na ang pagtaas ng COVID-19 cases sa ilang lugar.\n\n Para sa kalihim, kahit may mga dumating na at paparating pang bakuna, hindi puwedeng maging kampante ang publiko.\n\n \"Itong ating pagsunod sa mga minimum public health standards napakamahalaga. Hindi komo nabalitaan natin na may dumarating na bakuna, 'yung dumarating na bakuna kakaunti ho ito,\" sabi niya.\n\n Sa huling tala ng Department of Health, mahigit 114,000 na ang nababakunahan sa Pilipinas.\n\n Sa mga nabakunahan, halos 1,000 ang nakaranas ng tinatawag na adverse events.\n\n \"The most common adverse events that we have noted would be muscle pain, pain on the site of injection, fever. May iba na tumaas ang presyon, rashes. Usual lang po 'yan, hindi dapat ikatakot,\" ani Health spokesperson Maria Rosario Vergeire.\r\n    \r\nLabis na pag-iingat ang babala ngayon ng mga eksperto lalo na at patuloy na nakapagtatala ng mga bagong variant o mutation ng virus ang Philippine Genome Center.\n\n Sa isang pag-aaral ng iba-ibang eksperto sa bansa, sinabing may ebidensiya ng pagkakaroon ng bagong variant ng SARS-CoV2 sa Pilipinas, pero kailangan pa rin nito ng masusing imbestigasyon.\n\n Nakita ito sa 33 sample na kinolekta sa Central Visayas.\n\n Sa Facebook post ni Dr. Edsel Salvana na miyembro ng DOH technical advisory group, sinabi nitong may Philippine variant na na pinangalanang P.3. Maituturing daw ito na anak ng Brazil lineage na B1128.\n\n Ang Philippine Medical Association (PMA), ikinakatakot na baka mabalik na naman sa dati ang sitwasyon ng mga health worker kung saan marami ang nagkasakit at ilan pa nga ay pumanaw.\n\n \"We’re seeing right now a lot of our physicians are getting reinfection again. The problem is parang we're back from where we started from. Even those not in the frontlines are also getting sick... Let's be cautious of what we do now, let's follow the protocols,\" paalala ni Dr. Oscar Tinio ng PMA.\n\n —Ulat ni Raphael Bosano, ABS-CBN News\n\n"}, {"title": "Several senators hit PDP-Laban members for politicking amid COVID-19 pandemic", "datetime": "Mar 12 07:58 PM", "author": "ABS-CBN News", "article": "MANILA - Several senators on Friday criticized some members of ruling party PDP-Laban for raising possible candidates for the 2022 presidential elections despite the ongoing COVID-19 pandemic.\n\n Lacson specifically scored PDP-Laban members who even openly discussed their plan of encouraging President Rodrigo Duterte to run as vice president in 2022. Duterte himself, meanwhile, said his long-time ally, Sen. Christopher “Bong” Go wants to become president.\n\n Lacson said the money used to finance the “commissioned survey” should have just been donated to help the needy fight the pandemic.\n\n \"The timing is bad and insensitive to say the least,\" he said.\n\n \"Dapat ang focus ngayon ay sa lumalalang sitwasyon ng pandemya,\" he said.\n\n (The focus now should be on the worsening pandemic.)\n\n In a recent pre-election Pulse Asia survey, the tandem of Sen. Christopher \"Bong\" Go and President Rodrigo Duterte emerged as the preferred pair for President and Vice President in the 2022 elections, reports said.\n\n Lacson was listed as a possible presidential contender, with Manila Mayor Isko Moreno Domagoso as his running mate.\n\n Senators Francis Pangilinan and Joel Villanueva also slammed the survey.\n\n \"Especially now, with the rising cases of COVID and the slow vaccine rollout, we need to give full attention to managing the pandemic,” said Pangilinan, who was identified in the survey as the possible running-mate of opposition leader Vice President Leni Robredo.\n\n \"Unfortunately, nag-start na. Kumbaga sa basketball, papasok na ng arena ang mga player... unfortunately lahat tinitingnan na rin ang arena, 'yung 2022 elections,\" Villanueva said in a virtual press conference.\n\n (Unfortunately, it has started. Just like in basketball, the players are starting to enter the arena... Unfortunately, the arena everybody is looking at is the 2022 elections.)\n\n \"I think all of us should reflect on what is happening. We have a serious problem,\" he said.\n\n PDP-Laban resolution 'not legitimate'\n\n PDP-Laban president Sen. Manny Pacquiao said the resolution was \"not legitimate\" and directed his partymates to refrain from discussing the 2022 national elections this early.\n\n Pacquiao is another possible contender for the presidential race in 2022.\n\n RELATED VIDEO\n\n — Reports from Sherrie Ann Torres and Katrina Domingo, ABS-CBN News\n\n"}, {"title": "SC: PNP seeking from Calbayog RTC list of lawyers representing ‘communist-terrorist’ groups", "datetime": "Mar 12 07:48 PM", "author": "ABS-CBN News", "article": "MANILA—The Philippine National Police (PNP) on Friday requested to get from a court a list of lawyers representing members of supposed \"communist-terrorist\" groups in the country, the Supreme Court said.\n\n Supreme Court Spokesperson Brian Keith Hosaka said the Calbayog Regional Trial Court received the request signed by a certain PLT Fernando Calabria Jr. from the Calbayog City Police Station, but \"no action\" has been done by the said court so far.\n\n Supreme Court spox Brian Keith Hosaka confirms Calbayog RTC received this afternoon PNP’s request for a list of lawyers representing “Communist Terrorist Group” personalities, but says “no action has been made by them on the request.” pic.twitter.com/6Wj5dR8jvo\n\n \n\n Calabria identified himself as the chief intel of their Station Drug Enforcement Unit (SDEU). The request was made \"to the compliance from higher PNP offices.\"\n\n The police also attached a table, which included a \"mode of neutralization,\" and the lawyer's affiliations, among others.\n\n Recently, Calbayog mayor Ronald Aquino was killed on Monday, an incident that left 6 people dead and described as a shootout by authorities.\n\n Some have argued it was an ambush.\n\n RELATED VIDEO:\n\n Aquino's ally, Samar 1st District Rep. Edgar Mary Sarmiento, had repeatedly alleged that the local chief executive was killed by rogue members of the national police.\n\n Sarmiento said the police were wearing balaclavas and had high-powered firearms. The police have already formed a special investigation task group to probe the incident.\n\n 'AUDACIOUS REQUEST'\n\n In a statement, the National Union of Peoples' Lawyers (NUPL) described the request as \"audacious.\"\n\n \"This... request that is hard to refuse is the smoke in the gun traceable to the hand that pulled the trigger and the enablers of various attacks against lawyers especially human rights lawyers representing clients the State does not like,\" NUPL president Edre Olalia said.\n\n WATCH:\n\n Olalia added that it raised more questions about the incident, and floated the idea that the move is part of a bigger picture.\n\n \"It is at first unbelievable for its impudence but then again, it fits into the puzzle on the who, what, why and how of these attacks. The only remaining question is when and where,\" he said.\n\n Aquino is the latest local official slain under President Rodrigo Duterte's administration. His death has brought to 25 the tally of local executives killed in this administration.\n\n On Sunday, 9 activists were also killed in alleged police raids in provinces south of Manila.\n\n — With a report from Mike Navallo, ABS-CBN News\n\n"}, {"title": "Pagsipa ng COVID-19 cases di dapat isisi sa taumbayan: labor groups", "datetime": "Mar 12 07:41 PM", "author": "ABS-CBN News", "article": ""}, {"title": "Pagpapatupad ng curfew sa Metro Manila kasado na pero may mga di natuwa", "datetime": "Mar 12 07:31 PM", "author": "ABS-CBN News", "article": "MAYNILA — Sa darating na Lunes ay ipatutupad na sa Metro Manila ang unified curfew na aarangkada mula alas-10 ng gabi hanggang alas-5 ng umaga, na inaasahang makatulong sa pagkontrol ng pagkalat ng COVID-19.\n\n Para sa ilang mga tao, makatutulong ang pagkakasundo ng Metro Manila mayors sa unified curfew para mabawasan ang kalituhan, lalo't iba-iba noon ang patakaran ng bawat lokal na pamahalaan.\n\n Pero ang ilan, hindi masaya, katulad ni Aling Charito na may karinderya.\n\n Ang regular daw kasi nilang pamamalengke ay alas-3 ng madaling araw kaya kapag may curfew ay maaantala ang kanilang pamimili at pagluluto ng almusal para sa kostumer.\n\n \"Mawawala po 'yung mga kakain ng almusal sa amin,\" aniya.\n\n Umaaray din ang mga jeep at tricycle driver dahil mababawasan daw ang kanilang kita, lalo na't lumiit ito dahil sa pandemic.\n\n Ayon kay Antonio Gomez, tricycle driver, malamang ay wala na silang makuhang pasahero sa pila ng tricycle.\n\n \"Laking epekto sa 'min na walang kita. Sana maibalik ang dati. [Pero] wala tayong magagawa, sunod na lang tayo,\" aniya.\n\n Ang jeepney driver naman na si Jessy Soledad, naghahanda na sa mas maliit na kita.\n\n \"Magiging apektado kasi konti ang pasahero... Iiksi ang oras. Sa kita namin apektado din,\" hinaing niya.\n\n Giit ng hepe ng Quezon City Department of Public Safety and Order, tuloy ang pagpapatupad nila ng unified curfew pero may mga exemption naman daw.\n\n Kabilang dito ang mga nasa graveyard shift, delivery ng essential services, at iba pang maituturing na frontliners.\n\n Dalawang linggo lang dapat ito ipatupad ang unified curfew pero posibleng ma-extend.\n\n Nangangamba naman ang Employers' Confederation of the Philippines (ECOP) para sa mga manggagawang aabutin ng curfew sa kalsada.\n\n Sabi ni ECOP president Sergio Ortiz-Luis Jr., umaasa silang magbibigay ng \"pass\" ang mga lokal na pamahalaan para sa mga manggagawang maaapektuhan ng curfew.\r\n    \n—Ulat ni Zyann Ambrosio, ABS-CBN News\n\n"}, {"title": "Sasakyan ng DPWH, bumaliktad sa Eastern Samar; mga sakay ligtas", "datetime": "Mar 12 07:26 PM", "author": "ABS-CBN News", "article": "Bumaliktad ang isang pickup na pag-aari ng district engineering office ng Department of Public Works and Highways sa Eastern Samar, sa Barangay Bacayawan sa bayan ng Llorente, Huwebes ng hapon.\n\n Ayon sa impormasyon, galing sa bayan ng Lawaan at papuntang Borongan City ang sasakyan.\n\n Pagdating sa pakurbadang bahagi, nawalan ng kontrol sa manibela ang driver dahil sa madulas din ang daan sanhi ng pag-ulan.\n\n Bumaliktad ang behikulo pero agad naman nasagip ang driver at tatlong sakay nito.\n\n Patuloy ang imbestigasyon ng mga awtoridad.\n\n KAUGNAY NA BALITA:\n\n - Ulat ni Ranulfo Docdocan\n\n"}, {"title": "Contact tracing ipinag-utos sa mga nakasalamuha ni Sinas sa Oriental Mindoro", "datetime": "Mar 12 07:20 PM", "author": "ABS-CBN News", "article": "PNP Chief Debold Sinas habang binibisita ang MIMAROPA PNP Regional Headquarters.Photos Courtesy: Oriental Mindoro PIO\n\n PNP Chief Debold Sinas habang binibisita ang MIMAROPA PNP Regional Headquarters.Photos Courtesy: Oriental Mindoro PIO\n\n CALAPAN CITY—Huwebes ng gabi nang kumpirmahin ni PNP spokesperson Police Brigadier General Ildebrandi Usana na positibo sa coronavirus disease si Police General Debold Sinas.\r\n \r\nPero bago ang kumpirmasyon, naunang bumisita si Sinas noong umagang iyon sa Mimaropa PNP regional headquarters sa Camp Efigenio C. Navarro, Barangay Suqui, sa lungsod na ito.\n\n Kasama niya sina Police Major Gen. Rhodelo O. Sermonia, PNP Director for Community Relations, at Police Major Gen. Alfred S. Corpuz, PNP Director for Operations.\n\n Nasaksihan nila ang ceremonial COVID-19 vaccination para sa ilang medical workers ng kapulisan sa lalawigan.\r\n \r\nSumali rin ito sa tree planting activity at nagpasinaya ng ilang bagong tayong pasilidad sa headquarters.\n\n Sa pag-iikot naman ng heneral, nakausap nito si Dr. Hubbert Dolor, provincial administrator at OIC ng provincial health office.\n\n Sinabi ni Gov. Bonz Dolor, nagsasagawa ng contact tracing ang health office at inatasan ang mga nakasalamuha ni Sinas kasama si Dr. Dolor na mag-quarantine bilang pagsunod na rin sa protocol.\n\n Sabi pa ng LGU, naroon ang opisyal kasama ang team ng PHO para mapag-usapan ang vaccination rollout at contact tracing para sa mga naging contact o na-expose sa mga nagpositibo sa COVID-19 na pulis.\n\n Hindi raw dumaan sa pantalan ng Calapan si Sinas, bagkus dumiretso na agad si regional office, kaya walang gaanong contact sa mga empleyado ng provincial government.\n\n Ayon naman sa source ng ABS-CBN News sasailalim sa swab test ang mga opisyal ng PNP na mayroong close contact kay Sinas.\n\n Pero sa sa panayam sa telepono sa ABS-CBN News hindi pa ito kinukumpirma ng PIO ng PNP Mimaropa.\n\n Sa inilabas na pahayag ng Mimaropa PNP, ipinag-utos ang malawakang contact tracing sa mga police personnel na nakasalamuha ni Sinas.\n\n Naka-quarantine naman ngayon ang regional director ng Mimaropa PNP na si Police Brig. Gen. Pascual Munoz Jr.\n\n Humingi ito ng panalangin para sa agarang paggaling ng kanilang PNP Chief.\n\n RELATED VIDEO\n\n -- Ulat ni Andrew Bernardo\n\n"}, {"title": "Reaching for a bargain", "datetime": "Mar 12 06:55 PM", "author": "Jonathan Cellona, ABS-CBN News", "article": ""}, {"title": "Lalaki timbog sa tangkang pagsunog sa dating pinapasukang restoran", "datetime": "Mar 12 06:51 PM", "author": "ABS-CBN News", "article": "MALOLOS CITY, Bulacan — Timbog ang isang lalaki sa lungsod na ito matapos tangkaing sunugin ang dating pinagtatrabahuhang restoran noong Linggo ng madaling araw.\n\n Sa inisyal na imbestigasyon ng Malolos City police, nasunog ang ilang bahagi ng bubungan ng establisimyento sa Barangay Mojon pero naagapan din ito matapos ang ilang minuto.\n\n Kinilala ang suspek na si Louie Mangabat, na nakuhanan pa sa CCTV na naghagis ng tila bote na may apoy at mabilis na tumakas paalis angkas ng isang motorsiklo.\n\n Kinumpirma rin ng guard on duty na si Mangabat ang nakita niya ng may hawak ng nasabing bote.\n\n Nahuli si Mangabat habang tinutugis pa ang drayber ng motorsiklo na kasabwat nito.\n\n Napag-alaman na dating cook sa restaurant ang suspek, pero dahil sa pandemic ay hindi na muna ito pinapasok.\n\n Sinampahan na ng kasong arson si Mangabat.\n\n Pilit na humihingi ng dispensa ng suspek sa dating amo, pero wala na umano itong balak makipag-areglo.\n\n —Ulat ni Gracie Rutao\n\n"}, {"title": "4,578 bagong COVID-19 cases naitala, pinakamataas sa 6 na buwan", "datetime": "Mar 12 06:44 PM", "author": "ABS-CBN News", "article": "MAYNILA (UPDATE) — Nakapagtala ang Pilipinas ngayong Biyernes ng 4,578 bagong kaso ng COVID-19, ang pinakamataas na arawang bilang sa loob nang 6 na buwan.\n\n Dahil dito, sumirit na sa 611,618 ang kabuuang dami ng nagpositibo sa sakit, at 52,012 dito ay nananatiling aktibo, sabi ng Department of Health.\n\n Umabot naman sa 12,694 ang bilang ng mga nasawi sa sakit matapos makapagtala ng 87 bagong pagkamatay.\n\n Nakapagtala din ng 272 bagong recoveries kaya nasa 546,912 ang gumaling sa sakit.\n\n Kasabay ng pagdami ng naitatalang kaso ay ang pagpapatupad muli ng iba't ibang restriksiyon, tulad ng curfew, sa maraming lugar partikular na sa Metro Manila.\n\n Nauna nang sinabi ng OCTA Research Group na posibleng may kinalaman ang iba't ibang variant ng COVID-19 virus sa nakikitang pagdami ng kaso.\n\n 'LAGPAS-DOBLE'\n\n Ayon sa OCTA Research Group, umabot na umano sa mahigit 1,500 ang weekly average ng bagong COVID-19 cases sa Metro Manila noong nakaraang linggo.\n\n Pero bagaman nakatutok ang mga tao sa NCR, nakikitaan din ng pagtaas ang Calabarzon at Central Luzon regions.\n\n Sa analysis ng ABS-CBN Data Analytics team gamit ang DOH data, nasa 141 percent o mas malaki pa sa doble ang itinaas ng mga kaso ng COVID-19 sa NCR nitong huling 2 linggo.\n\n Tinitingnan ngayon ng DOH ang iba’t ibang dahilan ng pagtaas ng kaso, kasama na ang mga mas nakakahawa umanong variants.\n\n Malaki rin umanong problema ang hindi pa rin pagsunod sa health protocols ngunit mayroon ding iba pang nakikitang sanhi ng pagkalat ng sakit.\n\n \"Nakita natin itong home quarantine ang mga tao hindi na nailagay sa facilities for isolation or quarantine. Maaaring sa kagustuhan ng pami-pamilya pero ngayong nakikita natin ang pagtaas ng mga kaso, kailangan nating paghigpitan ito para di na siya maka-contribute dito sa pagkalat,\" ani DOH spokesperson Maria Rosario Vergeire.\n\n Nakikita ring problema ang hindi maayos na ventilation o daloy ng hangin at mga protocol sa pagpasok sa mga establisimyento.\n\n Dahil sa pagtaas ng mga kaso, problemado ang iba’t ibang ospital.\n\n \"'Yun pong ICU namin ang almost puno na,\" ani Philippine General Hospital spokesperson Dr. Jonas del Rosario.\n\n —May ulat ni Kristine Sabillo, ABS-CBN News\n\n"}, {"title": "Wastong pag-dispose sa face masks muling ipinaalala", "datetime": "Mar 12 06:41 PM", "author": "ABS-CBN News", "article": "MAYNILA — Muling hinikayat ng isang environmental group na itapon nang maayos ang mga ginagamit na face masks, na itinuturing na biowaste.\n\n Sa harap ito ng mga nakitang medical waste tulad ng disposable face mask sa ilang diving site sa bansa gaya sa Batangas.\n\n Sa panayam sa TeleRadyo, sinabi ni Oceana Philippines vice president Gloria Ramos na dapat i-segregate o ihiwalay mula sa ibang basura ang mga face mask. \r\n    \r\nDapat itong ilagay sa isang plastic, i-seal, at lagyan ng label na \"hazardous waste\" ang laman nito para hindi kalkalin ng mga basurero.\n\n \"Dapat i-separate talaga, i-segregate kasi nakakahawa siya. Kawawa naman ang mga collector natin and then to make sure na hindi yan magli-leak sa mga karagatan natin,\" aniya. \r\n    \r\nKung maaari, hinimok ni Ramos ang publikong magsuot na lang ng reusable face masks para makabawas sa medical waste.\n\n RELATED VIDEO:\n\n"}, {"title": "Mangingisda nalunod matapos subukang mag-ayos ng fish pen", "datetime": "Mar 12 06:39 PM", "author": "ABS-CBN News", "article": "BAROTAC VIEJO, Iloilo - Wala nang buhay nang matagpuan ng mga kasamahan ang isang mangingisda matapos sisirin at ayusin ang nasirang fish pen sa gitna ng dagat noong Huwebes.\n\n Nakilala ang biktima na si John Rex Balayo, 29, isang mangingisda at nakatira sa Barotac Viejo sa Iloilo.\n\n Ayon sa imbestigasyon ng awtoridad, pumalaot si Balayo kasama ang 2 kaibigan upang ayusin ang nasirang fish pen.\n\n Nakadalawang sisid na umano si Balayo subalit sa ikatlong beses nito ay hindi na ito nakaakyat pa.\n\n Agad na hinanap ng 2 kasamahan ang biktima at makalipas ang ilang minuto ay nakita nila ang katawan nito sa may fish pen.\n\n Agad na dinala sa ospital ang biktima subalit ideneklara na itong dead on arrival.\n\n —Ulat ni Rolen Escaniel\n\n"}, {"title": "PNP to set up checkpoints at COVID-19 hotspots, as infections spike", "datetime": "Mar 12 06:38 PM", "author": "Isay Reyes, ABS-CBN News", "article": "MANILA — The Philippine National Police (PNP) said Friday it would set up sporadic or random checkpoints in different \"hotspots of infections\" to curb the fresh spike of COVID-19 cases.\n\n \"Sporadic checkpoint lang po muna in hotspots of infections. We have to understand and adjust to current situation where movement of people, goods and services is also at stake,\" PNP spokesman Police Brig. Gen. Idelbrandi Usana told ABS-CBN News.\n\n \"The uniform curfew regulations in NCR will start on Monday po. But the sporadic checkpoints in areas that the local police may consider may start any time, as the DILG directed strict implementation of minimum health and safety protocols po.\"\n\n The checkpoints would only \"ensure\" the people on board vehicles are complying with minimum health and safety protocols.\n\n \"Our presence is merely to ensure people's strict compliance with minimum health and safety protocols, implement ordinances in the localities, and work with other institutions of the government to make our people safe from the pandemic amid the spike,\" the official said.\n\n Earlier in the day, Palace Spokesperson Harry Roque said police presence will be heightened to ensure the public adheres to health protocols.\n\n The Philippines on Friday reported 4,578 confirmed COVID-19 infections, the first time in 2021 the daily number surpassed 4,000 and the highest in 6 months. Overall, the country's total cases stood at 611,618.\n\n RELATED VIDEO\n\n"}, {"title": "NBI: Traces of illegal drugs found in room where Dacera, companions stayed", "datetime": "Mar 12 06:07 PM", "author": "Angela Coloma, ABS-CBN News", "article": "MANILA (UPDATE) - Traces of drugs were found in the Makati hotel room where Christine Dacera and her friends stayed before her death on New Year’s Day, results of the National Bureau of Investigation probe showed.\n\n This was among the evidence the NBI used as basis to file several criminal charges, including drug-related complaints, obstruction of justice, perjury and reckless imprudence resulting in homicide against 11 people, including Dacera’s companions at the time.\n\n Mark Anthony Rosales and Rommel Galido were charged for illegal drug use, as they allegedly tried to deliver or give away drugs at the party, on top of the obstruction of justice charges filed by the NBI against them and their other companions.\n\n Apart from Rosales and Galido, John Dela Serna, Gregorio De Guzman, Jezreel Rapinan, Alain Chen, Reymay Englis, and Darwin Macalla are also facing obstruction of justice charges.\n\n The parallel investigation requested by Dacera’s family found that there was drug use at Room 2209 of the City Garden Grand Hotel, where Dacera and her friends stayed, based on statements by witnesses who were at the scene of the incident.\n\n Crime scene investigation found traces of fluoromethamphetamine and methamphetamine, both stimulant drugs, in vomit near the toilet bowl where Dacera had puked in the wee hours of January 1.\n\n \"One of the matters taken by SOCO (Scene of the Crime Operatives) at vomitous matter at around 6:39, makikita mo si Tin sa harap ng toilet bowl by the occupants of room 2209 so 'yung portion na 'yon, 'yung vomitous matter na 'yun was taken in the forensic [examination]. That vomitous matter has presence of 4 flouromethamphetamine and methamphetamine so dalawa ang nakitang illegal drugs,\" Zylykha Marie Corales Deramo of the NBI said in a press conference.\n\n (You can see Tin in front of a toilet bowl and helped by the occupants of Room 2209, so that portion, that vomitous matter was taken in the forensic [examination]. That vomitous matter has presence of 4 flouromethamphetamine and methamphetamine so two types of illegal drugs were found.)\n\n Deramo also added that Dacera herself allegedly stayed at room 2207, the neighboring room, not wanting to be at room 2209 because there was an “orgy” happening in the room and that they were high on drugs.\n\n \"When she (Tin) went to room 2207 she alleged na ayaw na niya doon kasi number one nag-o-orgy ang mga ito and number 2, shuas. When we asked the occupants of room 2207 kung ano ang shuas, apparently it’s gay lingo for 'high',” Deramo said.\n\n (When she went to Room 2207, she alleged that she does not want to be in [2209] because number 1, they were having an orgy and number 2, shuas. When we asked the occupants of room 2207 what shuas was, apparently it's gay lingo for 'high'.)\n\n A witness who spent the night at Room 2207 also said Rosales offered him drugs.\n\n \"One of the occupants of room 2207 ay nakapagsabi na pumasok siya sa room 2209, common friend niya si Rommel, nagsabi 'baks may party drugs kami, bet mo?' Sabi niya ayoko. Apparently, hindi siya user pero nagpumilit itong si Rommel, went to a friend and asked for such party drugs. Sinabi niya na 'sorry baks ubos na pala,' so no more, so that’s corroboration,\" Deramo said.\n\n (One of the occupants of room 2207 said when he entered room 2209, Rommel said \"we have party drugs, want some?\" He said no. Apparently he's not a user but allegedly, Rommel insisted, went to a friend and asked for such party drugs. But then said \"sorry there's no more,\" so no more, so that's corroboration.)\n\n There was also \"insinuation\" that Dacera herself took drugs, she added, but the NBI did not categorically say she did.\n\n \"JP Dela Serna and Rommel Galido also insinuated na Tin also used, na gumamit, ang sabi niya 'Mali kasi 'yon ang ecstasy at alcohol kasi 'yung heartbeat' but did not mention who took what ecstasy,\" she said, adding that Dacera had allegedly disclosed to Garrido that her drink was spiked by Mark Rosales.\n\n (JP Dela Serna and Rommel Galido also insinuated that Tin also used, he said \"it's wrong, ecstasy and alcohol affects the heartbeat' but did not mention who took what ecstasy.)\n\n Findings by the NBI contradict statements by Dacera’s companions that there was no drug use at the party.\n\n However, the \"interplay between drugs and alcohol\" at the incident, according to Deramo, was still \"not very clear.\"\n\n The reautopsy of Dacera’s body showed that her cause of death was “microscopic evidence of peri-aortic hemorrhages and aortic wall distruption.”\n\n The toxicology report also showed that Dacera’s body had traces of Diltiazem, a prescription drug for hypertension. Asked when illegal drugs may have caused her death, the NBI said it was “medically probable” for drugs to have started the aortic rupture on her body, based on scientific evidence they have gathered.\n\n \"We’re not saying Christine Dacera took Diltiazem that night. We’re saying na she had been taking Diltiazem which has been found sa presence ng liver and then 'yung sa stomach. This is to help her condition,\" NBI Spokesperson Ferdinand Lavin said in the press conference.\n\n \"On the night when she took illegal drugs and alcohol, it defeated the purpose of which she was taking the Diltiazem. Natalo 'yung kaniyang Diltiazem because she knew na mayroon siyang condition (Her Diltiazem was overpowered because she knew that she had the condition),” NBI Spokesperson Ferdinand Lavin said in the press conference.\n\n The NBI, meanwhile, said they cannot prove rape allegations, as there were no fresh abrasions found on her labia at the time, at par with evidence presented by the PNP.\n\n Police had initially suspected the case was one of rape with homicide.\n\n Dacera, 23 was found unconscious and without a pulse in a bathtub at the Makati hotel around 12:30 p.m. on January 1 after a night of partying. Her friends said they tried to revive her and brought her to the Makati Medical Center, where she was later declared dead.\n\n Dacera and her friends had booked Room 2209 at City Garden Grand Hotel in Makati City to ring in the New Year. According to CCTV footage, they went back and forth to Room 2207 after being introduced to guests there.\n\n The PNP, in a medico-legal report, said Dacera died of natural causes, ruling out that her death on New Year’s day was a crime after initially suspecting rape and homicide against her companions.\n\n RELATED VIDEO:\n\n"}, {"title": "TIPS: Paano labanan ang 'pandemic fatigue' habang isang taon nang naka-lockdown", "datetime": "Mar 12 06:03 PM", "author": "Josiah Antonio, ABS-CBN News", "article": "MAYNILA — Tila mabilis makaranas ng pagod at pagkalugmok ang mga Pilipino, isang taon na makalipas isailalim kalakhang Maynila at ibang probinsiya sa iba't-ibang level ng quarantine.\n\n Sa ilalim ng lockdown, marami ang nakulong sa kanilang mga tahanan at kasamang naiuwi na rin ang mga pang-araw-araw na gawain tulad ng trabaho o pag-aaral. Nitong mga nakaraang buwan, marami na rin ang nakaranas ng pagkabalisa kahit nasa loob ng bahay.\n\n Ayon sa psychologist na si Randy Dellosa, tinatawag itong pandemic fatigue o ang physical, mental at emotional exhaustion dahil sa pagtitiis sa sitwasyon sa ilalim ng isang pandemya.\n\n Aniya, nagreresulta ito ng ilang mga pagbabago sa buhay ng isang tao tulad ng mga sumusunod:\n\n \"It is getting 'sick and tired' of trying to consider as a \"new normal\" what in reality is an obvious \"abnormal,\" sinabi ni Dellosa sa ABS-CBN News nitong Biyernes.\n\n \"Pandemic fatigue is also about desperately wanting to regain the previous \"normal\" but feeling helpless for it to happen,\" dagdag pa niya.\n\n Ayon sa eksperto, makikita ang manipestasyon ng pandemic fatigue sa ilang mga pakiramdam tulad ng mga sumusunod:\n\n Aniya, maaari rin itong makaapekto sa pang-araw-araw na gawain at maaaring maramdaman ang ilan sa mga sumusunod:\n\n \"People who are tired of the pandemic may simply give up on following the protocol for COVID-19 prevention such as social distancing, wearing masks and face shields, and hand-washing,\" aniya.\n\n Dagdag pa ni Dellosa, maaaring mag-develop sa mental health problems o mas lumala pa kung mayroon nang pre-existing conditions.\n\n \"The longer the pandemic fatigue is experienced, the higher the possibility for psychiatric disorders to develop. The most common psychiatric disorders that can develop from pandemic fatigue are major depressive disorder and anxiety disorders,\" saad ng doktor.\n\n \"People who were experiencing mental health issues prior to the pandemic are prone to relapse and worsening of their mental health condition. People with relationship problems prior to the pandemic are likewise expected for their relationships to sour even more,\" dagdag pa niya.\n\n Habang patuloy pa rin ang lockdown sa pag-asang mapuksa na ang virus sa ating bansa, mayroon mga tips si Dellosa para sa mga Pilipino.\n\n KAUGNAY NA ULAT\n\n"}, {"title": "On-site work at DOJ offices suspended until March 16 for COVID-19 disinfection", "datetime": "Mar 12 05:55 PM", "author": "ABS-CBN News", "article": "MANILA—On-site work at the Department of Justice headquarters has been suspended until March 16, Tuesday, for disinfection, as a number of reported COVID-19 cases at the DOJ proper” were found.\n\n Department personnel will continue working from home, according to Justice Secretary Menardo Guevarra.\n\n On Thursday, the Supreme Court, adjacent to DOJ premises said it was closing its offices for disinfection until March 14, as part of precautionary measures amid the rising number of COVID-19 cases.\n\n From March 15 to 19, offices will be required to have a skeleton force of just 50 percent reporting from work.\n\n The Philippines on Friday reported 4,578 confirmed COVID-19 infections, the highest in 6 months.\n\n OCTA Research previously projected that the Philippines will reach 6,500 daily infections by the end of the month.\n\n -- With reports from Mike Navallo, ABS-CBN News\n\n"}, {"title": "Bahay inararo ng kotse, 1 sugatan", "datetime": "Mar 12 05:38 PM", "author": "ABS-CBN News", "article": "Isa ang sugatan matapos na araruhin ng kotse ang isang bahay sa Barangay Lantangan, Pontevedra sa Capiz, Huwebes ng gabi.\n\n Ayon sa imbestigasyon ng awtoridad, patungong Roxas City ang pribadong kotse nang makasalubong ang isang sasakyan na naka-high beam ang ilaw.\n\n Nasilaw umano ang driver sa ilaw at tuluyang bumangga sa bahay.\n\n Dumiretso ang sasakyan sa loob ng bahay at naipit ang 14-anyos na residente nitong kasalukuyang nag-aaral ng kaniyang modules.\n\n Agad na dinala sa ospital ang estudyante at patuloy pang ginagamot ito.\n\n Wala namang planong magsampa ng kaso ang pamilya ng estudyante laban sa driver ng pribadong sasakyan na handang sagutin ang pagpapagamot ng biktima sa ospital.\n\n - Ulat ni Rolen Escaniel\n\n"}, {"title": "'Not legitimate,' Pacquiao says of PDP-Laban members' push for Duterte vice-presidential bid", "datetime": "Mar 12 05:24 PM", "author": "Katrina Domingo, ABS-CBN News", "article": "MANILA - PDP-Laban president Sen. Manny Pacquiao on Friday said a supposed party resolution urging President Rodrigo Duterte to run as vice president in the 2022 national elections is illegitimate.\n\n PDP-Laban has yet to finalize its line-up for the 2022 national elections, Pacquiao said in a press conference.\n\n \"Hindi legitimate 'yung resolution na ginawa. Nalaman ko lang 'yun dahil sinabi sa'kin ng tao ko,\" he said.\n\n (The resolution is illegitimate. I only knew about it because one of my staff told me.)\n\n \"Hindi ko alam 'yun. Hindi 'yun sanctioned as acting president ng partido,\" he said.\n\n (I did not know about it. It was not sanctioned [by me] as acting party president.)\n\n The said resolution, dated March 8, was signed mostly by mayors and lawmakers, Melvin Matibag, PDP-Laban deputy party secretary general, earlier told ABS-CBN News.\n\n Among the signatories were MMDA chairman Benhur Abalos, Mandaluyong Mayor Carmelita Abalos, Quezon City Rep. Alfred Vargas, and Parañaque City Mayor Edwin Olivares.\n\n Sen. Aquilino Pimentel III said differences among party members on whether or not Duterte should run as vice president should not be considered as infighting.\n\n \"'Wag ninyo i-characterize as infighting,\" Pimentel said.\n\n (Do not characterize it as infighting.)\n\n \"Sen. Manny Pacquiao is reminding the members to focus sa pagtulong. Darating 'yung time para sa pulitika. Hintayin natin 'yung time para sa pulitika,\" he said.\n\n (Sen. Manny Pacquiao is reminding the members to focus on helping. The time for politics will come. Let's wait for that time to come.)\n\n Pacquiao on Friday issued a \"warning\" against Energy Secretary Alfonso Cusi, the party vice-chair, who he said was sowing division within the group.\n\n The senator made the statement as he asked members to refrain from talking about the upcoming elections as the country continued to grapple with the COVID-19 pandemic.\n\n Cusi was allegedly among PDP-Laban members behind the resolution urging Duterte to run for vice president.\n\n On the same day the resolution was released, Duterte himself talked politics, saying his long-time ally Sen. Christopher \"Bong\" Go was aspiring to become president. Go denied this in a statement but said he might change his mind if the current chief executive would agree to run for vice president.\n\n DISCIPLINARY ACTION\n\n Pacquiao belied allegations that several party members were planning to break away from the ruling party, saying more politicians want to join PDP-Laban.\n\n \"Marami pang gusto mag oath, sumama sa partido. Sabi ko 'wag muna dahil pandemic pa, bawal pa,\" he said.\n\n (Many want to take their oath, join the party. I said not yet because the pandemic is still going.)\n\n When asked about conflicting statements being released by several PDP-Laban members, Pacquiao said: \"Inaayos na natin 'yung mga lumalabas na isyu.\"\n\n (We are already fixing the issues.)\n\n \"Aaksyunan namin 'yang mga ganiyan na hindi sumusunod sa partido,\" said Pacquiao, who boxing promoter Bob Arum last year said might also seek the presidency.\n\n (We will act on those who refuse to toe the party line.)\n\n Instead of disclosing specific sanctions against erring members, Pacquiao released a memo calling for unity within the party and directing all PDP-Laban members to avoid discussing politics at this time as the COVID-19 pandemic continues.\n\n \"I have the responsibility to enforce rules, promote cooperation, insist on civility and respect, and most of all, to remind you that we are one team,\" his memo read.\n\n \"Before we can truly solve the problems of the country, we must first focus on ourselves and our beloved party.\"\n\n This is not the first time PDP-Laban seemed divided months before an election.\n\n In 2018, a group from Mindanao claiming to be party members on Wednesday held an event at the Quezon Memorial Circle criticizing then PDP-Laban Secretary General Pantaleon Alvarez.\n\n The group, led by PDP-Laban national council chair Rogelio Garcia, slammed Alvarez for leading the mass-oath taking of new party members without complying with the application process.\n\n Old party members were not invited to PDP-Laban's 36th anniversary celebration at a hotel in Makati City, Garcia added.\n\n The group issued a resolution declaring Alvarez persona non grata from the party, but then-party president Pimentel denied that PDP-Laban had made such a declaration.\n\n In 2019, Alvarez accused the ruling party of keeping him in the dark about its decision to back Marinduque Rep. Lord Allan Velasco's bid for the House Speakership, which he was also vying for.\n\n Alvarez was hoping to make a comeback as Speaker after he was ousted from the post in 2018 in a coup maneuvered by the President's daughter, Davao City Mayor Sara Duterte. Then Pampanga Rep. Gloria Macapagal Arroyo was installed in his place.\n\n RELATED VIDEO\n\n"}, {"title": "Lalaki, arestado sa panggagahasa sa 3-taong gulang na apo", "datetime": "Mar 12 04:31 PM", "author": "ABS-CBN News", "article": "Hindi na nakapalag pa ang isang 64-anyos na lalaki nang arestuhin ng mga operatiba ng Sasmuan Municipal Police Station sa Pampanga dahil sa kasong panggagahasa noon Martes.\n\n Sa inisyal na imbestigasyon, ginahasa umano ng suspek ang 3-taong gulang niyang apo.\n\n Matapos magsumbong sa pulisya, kaagad na nagkasa ng operasyon ang pulisya na nagresulta sa pagkakadakip sa suspek.\n\n Kinasuhan na kasong rape at child abuse ang suspek.\n\n - Ulat ni Gracie Rutao\n\n"}, {"title": "Isolation polling place, covered voting booths ready for Palawan plebiscite amid pandemic", "datetime": "Mar 12 04:20 PM", "author": "Adrian Ayalin, ABS-CBN News", "article": "ROXAS, Palawan— Andres Soriano Memorial Elementary School teachers picked up their own “anti-COVID-19” supplies consisting of disinfectants, gloves, and face masks Friday for the Saturday plebiscite on the proposal to divide Palawan into three provinces.\n\n LOOK: Teachers in Roxas town claim their \"anti-COVID-19\" supplies ahead of Saturdays plebiscite on the division of Palawan. Election paraphernalia such as ballots will be distributed early Saturday morning. pic.twitter.com/FsvSvnmWZl\n\n Some walked to the gymnasium which is around 200 meters away, while some took their own motorcycles to claim their supplies placed in a black trash bag.\n\n WATCH: Teachers in Roxas, Palawan took their own motorcycles to pick up their supplies for the plebisicite tomorrow on dividing the province into three. pic.twitter.com/VLEvVZqRWj\n\n “Ganun po talaga kailangang tawag ng tungkulin,” teacher Irene Carandang said.\n\n (Its's the call of duty, that's how it is.)\n\n The plebiscite will proceed in the province amid the continuing threat of COVID-19, with nationwide cases seeing a recent spike and new variants detected.\n\n The Commission on Election said protective implements have been put in voting precincts to prevent infection during the in-person voting.\n\n While the poll body provided 5 voting booths with plastic barriers, the teachers that will man them will also have to provide for their own.\n\n “'Yung plebcom gumawa na rin sila ng sarili nilang barrier para proteksyon din sa kanila, 200 na tao lalapit sa kanila dapat protected din sila,” school principal Concepcion Verdin said.\n\n (The Plebcom [plebiscite committee] made their own barriers for their protection.)\r\n \r\nAn isolation polling place, a requirement by the Comelec to accommodate those registering with a temperature of 37.5 degrees Celsius, was also set up in the school gymnasium.\n\n LOOK: Andres Soriano Memorial Elementary School in Roxas town now ready for tomorrow's plebiscite on the proposed division of Palawan, with 5 voting booths per precinct and an \"isolation polling place\" inside the gym for those with temperature of 37.5 degrees Celsius. pic.twitter.com/ZT4eX6lKf4\n\n The Commission on Human Rights, as well the Philippine National Police, inspected the 38 precincts of the school, as well as other schools participating in the plebiscite.\n\n “Dahil mandato nga ng Commission on Human Rights na masigurado na ang lahat ay makaboto lalo na ang marginalized natin, vulnerable and disadvantaged, 'yun 'yung gusto namin na makita,” CHR provincial officer Marilou Sebastian said.\n\n (We wanted to see it because it is our mandate to ensure that all, including the marginalized, vulnerable and disadvantaged, are able to vote.)\r\n \r\nThe Palawan Provincial Police Office have, meanwhile, deployed police officers ahead of the plebiscite.\r\n \r\n“Maayos naman po ang kapulisan natin lalo na sa Palawan PPO, naka-ready na at naka-deploy na po sa ngayon,” Deputy Provincial Director Lt. Col. Ariel Sanchez said.\n\n (Our police, especially the Palawan PPO, is ready and have been deployed.)\n\n Barangay Poblacion 3 Capt. Jesus Miraflores said that the proposed division of Palawan will benefit their community as this early, at least 3 malls are being planned in Roxas town.\n\n “Sa ngayon po marami na ang businessman na lumalapit sa bayan ng Roxas especially dito po sa bayan, nagtatanong kung magkano ang presyo ng lupa baka sakali manalo ang yes may intensyon po sila bumili ng lupa para makapag-establish ng kanilang negosyo,” Miraflores said.\n\n (Many businessmen are already asking for land prices particularly in Roxas so they could establish their businesses here in case the 'Yes' vote wins.)\n\n In tourist spot El Nido, oppositors were vocal against the division of the province which they say is not necessary as improvements can be done within the present system of government.\n\n They said the division would only create more positions for politicians.\n\n “Mula po sa iba-ibang sektor ng lipunan, ibang religious organizations, nagkaisa po kami para ipakita ang pwersa namin sa pagtututol sa 3-in-1 Palawan,” El Nido resident Renator Tenorio said.\n\n (From other sectors of society, other religious organizations, we are united against a 3-in-1 Palawan.)\n\n"}, {"title": "PH logs 4,578 new COVID-19 cases, highest so far in 2021", "datetime": "Mar 12 04:06 PM", "author": "Job Manahan, ABS-CBN News", "article": "MANILA (2nd UPDATE)—The Philippines on Friday reported 4,578 confirmed COVID-19 infections, the first time in 2021 the daily number surpassed 4,000 and the highest in 6 months.\n\n Overall, the country's total cases stood at 611,618.\n\n This developed, as Metro Manila mayors agreed to reimpose a curfew for two weeks starting Monday, and the OCTA Research group sounded the alarm on the spike of infections in the capital region in recent weeks.\n\n The day's fresh cases are the highest since last September 14, when the Department of Health (DOH) announced 4,699 confirmed infections, the ABS-CBN Investigative and Research Group said.\n\n The new figure is also considered the highest announced daily COVID-19 tally so far this year, data showed. The country also reported a record-daily high on Thursday, when the DOH logged 3,749 infections.\n\n It does not, however, include data from the 5 DOH-accredited laboratories that failed to submit results on time.\n\n Active cases reached 52,012, with 92.2 percent of the patients experiencing mild symptoms or are asymptomatic, according to the health department.\n\n RELATED VIDEO:\n\n The total number of active infections is also considered the highest since October 17 last year, ABS-CBN Data Analytics Head Edson Guido said. It was also the day when active cases last breached 50,000, he said.\n\n Deaths rose to 12,694 after the DOH logged 87 more COVID-related fatalities.\n\n ABS-CBN IRG also noted that the day's deaths is the highest announced by DOH in a single day since Feb. 20, when the agency announced 239 deaths.\n\n Recoveries, meanwhile, increased by 272 to 546,912, data showed.\n\n Out of the 32,156 individuals who underwent testing for COVID-19, some 3,425 or 10.7 percent yielded positive for the disease.\n\n BREAKDOWN OF NEW CASES\n\n According to Guido, almost half or 2,158 of the newly-reported cases came from Metro Manila, the highest daily increase since Sept. 14 last year.\n\n NCR was followed by Calabarzon with 625. This is the highest daily tally from the region since Oct. 17 last year, he said.\n\n Topping the list of cities with the highest recorded cases on Friday were Quezon City with 481, Pasay with 280, Manila with 276, Bulacan with 260, Cavite with 225, and Rizal with 186.\n\n A total of 8 duplicates, meanwhile, have been removed from the cumulative tally, said the health department. Five of those were recoveries while a case was a fatality.\n\n Some 26 cases previously identified as recoveries also turned out to be deaths after the agency's final validation.\n\n The OCTA Research group earlier in the day projected the daily cases in the country to reach over 6,500 by end March, should the rate of infections become uncontrolled.\n\n They also pointed out that the capital region alone might also record some 4,000 new cases at the end of the month, due to its increasing reproduction value.\n\n Because of this, the team of researchers urged local government units to implement stricter health measures, including localized lockdowns and border controls.\n\n The country's top health officials earlier denied that the detected presence of COVID-19 variants locally led to the recent spike of infections, and blamed the public becoming more \"lax\" in observing minimum health protocols.\n\n"}, {"title": "Patrol car pinasabugan sa Iloilo, 1 sugatan", "datetime": "Mar 12 03:59 PM", "author": "ABS-CBN News", "article": "Sugatan ang isang pulis matapos pasabugan ng improvised explosive device ang kanilang patrol car sa Barangay Pughanan sa bayan ng Lambunao, Iloilo, Biyernes ng umaga.\n\n Natamaan ng shrapnel sa kaliwang kamay si P/MSgt. Christopher Losbañez na nakasakay sa unahan ng back-to-back patrol car.\n\n Si Losbañez ay kasapi ng Lambunao Police.\n\n Papunta sana sa Barangay Panuran ang mga pulis para mag-imbestiga sa nangyaring engkuwentro noong Huwebes ng hapon nang tambangan at pasabugan ng IED ang kanilang sasakyan.\n\n Mabilis naman na rumesponde ang mga naka-deploy na sundalo sa kalapit na mga lugar at nagkaroon pa ng bakbakan na tumagal ng halos kalahating oras.\n\n Wala pang naiulat na nasawi o nasugatan sa patuloy na clearing operation.\n\n Inaalam pa ng awtoridad kung iisang grupo lang ng mga rebelde ang responsable sa magkasunod na pag-atake sa tropa ng gobyerno.\n\n - Ulat ni Nony Basco\n\n"}, {"title": "DOH says there’s enough time for 2nd AstraZeneca dose before May expiration", "datetime": "Mar 12 03:57 PM", "author": "Kristine Sabillo, ABS-CBN News", "article": "MANILA — The Department of Health assured the public on Friday that the government has enough time to administer the 2nd dose of AstraZeneca’s COVID-19 vaccines before they expire in May, saying none of the vaccines on emergency use around the world have a lengthy shelf life.\n\n Health Undersecretary Maria Rosario Vergeire on Friday belied reports that the government was rushing to administer the AstraZeneca vaccines because they are about to expire.\n\n The country earlier received 525,600 doses of AstraZeneca vaccines and 600,000 doses from Sinovac.\n\n “Wala pong bakunang dinevelop ngayon under the emergency use authority all over the world na may mahabang expiry date,” Vergeire said during a briefing.\n\n (There is no vaccine that was just developed and under emergency use authority all over the world that has a long expiry date.)\n\n The vaccines of AstraZeneca and Sinovac were both given emergency use authorization by the Philippine government. While they are still under development, they were already allowed for public use through the government program because of the emergency situation.\n\n “Ang pinakamahabang expiry date ng mga bakuna sa ngayon 6 months dahil alam ng manufacturers evolving ang ating sitwasyon at maaaring baguhin o iayos ang mga bakunang inilagay nila dyan sa pinapagamit sa mga bansa kaya ganun lang ang expiry,” Vergeire said.\n\n (The longest expiry date for vaccines for now is 6 months because the manufacturers know that the situation is evolving and that they may change or correct the vaccines that they are allowing countries to use. That’s why the expiry date is like that.)\n\n “'Yung dumating po sa atin 'yan po ang expiry sa end ng May,” Vergeire said.\n\n “Pero nakaayos ang strategies natin because ang 2nd dose po n'yan you can give from 4 weeks to 12 weeks. So pasok na pasok ang ating schedule at aabot naman sa lahat ang pagbabakuna.”\n\n (The ones that arrived here expire by the end of May. But our strategies are in place because the 2nd dose can be given from 4 to 12 weeks. So it is within our schedule and the doses can be used for vaccination.)\n\n Vergeire said the only reason they are trying to hasten the vaccination process is to ensure that health workers are vaccinated.\n\n As of March 10, 114,615 health workers have already been vaccinated against COVID-19.\n\n Vergeire said the 114,615 vaccinated represent 11.2% of the over 1 million health workers on the government's priority list.\n\n Majority or 101,827 of those vaccinated received Sinovac jabs while 12,788 received doses from AstraZeneca.\n\n “The top 3 regions with the highest coverage for Sinovac are the National Capital Region with 40.7%, CAR (Cordillera Administrative Region) at 13.9% and Region 12 at 11.7%,” Vergeire said.\n\n Meanwhile, AstraZeneca, which arrived a week later than Sinovac, is being used in the National Capital Region, Cordillera Administrative Region, Region 1 and Region 4A.\n\n The country hopes to vaccinate up to 70 million Filipinos by the end of the year in a bid to reach herd immunity. However, some have criticized the government for the seemingly slow rollout of vaccines.\n\n Vergeire said it is just slow because they have just started, adding the pace would be quicker eventually.\n\n She said Health Secretary Francisco Duque III already raised the issue and they have been talking to vaccination units to hasten the process.\n\n"}, {"title": "OCTA projects over 6,500 new daily COVID-19 cases in PH by end-March", "datetime": "Mar 12 03:50 PM", "author": "Job Manahan, ABS-CBN News", "article": "MANILA (UPDATED)— The Philippines might record over 6,500 new daily COVID-19 cases by the end of March, the OCTA Research group warned Friday, as it urged local governments to impose stricter measures to control the virus spread.\n\n In a report, the team of researchers said Metro Manila alone may record up to over 4,000 new daily COVID-19 infections at the end of the month, as it also continues to log most of the new daily COVID-19 infections in the Philippines due to the increase in reproduction number (R) in the region at 1.86.\n\n The R number indicates the rate of spread of the disease. An R value above 1 can lead to exponential growth.\n\n \"In the February 17 report, the number of new COVID-19 cases in NCR was projected to reach 2,000 on March 22. It appears that the current trend is faster, as the region tallied nearly 2,000 cases on March 11, 11 days earlier than projected,\" the experts explained.\n\n The development came as the country reported 3,749 new cases on Thursday, the highest in a day since September last year. OCTA said some 1,975 of these fresh infections came from Metro Manila alone.\n\n \"It is important that the increase in new cases in the NCR be curbed in order to avoid a high number of new cases in NCR and to prevent overwhelming the hospitals of NCR and the regions surrounding NCR (Cavite, Rizal, Bulacan),\" the group said.\n\n Aside from the increase in R value, the researchers also pointed out that the average daily attack rate (ADAR) in the region is now at 11 per 100,000. This puts the region at \"high risk,\" they said.\n\n ADAR is the number of new cases in a city or province over a two-week period, divided by the population of the city or province.\n\n RELATED VIDEO:\n\n 12 NCR cities included in 15 LGUs with high daily cases\n\n Quezon City topped the areas in the country that recorded new COVID-19 cases in the past week, averaging with 274 confirmed infections daily.\n\n The group added that aside from QC, 11 other cities in Metro Manila were included in the top 15 areas that logged a high number of newly-reported infections between Mar. 5 to Mar. 11.\n\n Local chief executives in the Metro on Thursday night agreed to reintroduce a two-week curfew hours starting on Monday, March 15, in a bid to contain the virus.\n\n Researchers however belief the curfew is not enough.\n\n The local government should now also intervene to prevent inundating hospitals, and \"put an end to this surge,\" they said.\n\n \"Localized lockdowns have been shown to be effective in slowing down increasing trends in new cases. Additional restrictions such as curfews, border controls, reduced capacity in certain establishments, limitations in social gatherings... as well as continued monitoring and strict implementation by the local governments will hopefully slow down the rate of infection in NCR,\" the report read.\n\n The country's top health officials earlier denied that the detected presence of COVID-19 variants locally led to the recent spike of infections, and blamed the public becoming more \"lax\" in observing minimum health protocols.\n\n But a survey conducted by the same group of researchers showed that a majority of Filipinos complied with wearing face masks and washing of hands when they go out of their homes, but many failed to abide by physical distancing measures.\n\n - With a report from Kristine Sabillo, ABS-CBN News\n\n"}, {"title": "Nearly a year into quarantine, gov't deploys more cops in bid to curb COVID-19 spike", "datetime": "Mar 12 03:40 PM", "author": "Jamaine Punzalan, ABS-CBN News", "article": "MANILA — Police presence will be heightened to ensure the public adheres to health protocols, Malacañang said on Friday as Philippines records daily-record highs in COVID-19 cases.\n\n The Department of the Interior and Local Government earlier this week ordered the police to increase police deployment and strictly enforce minimum public health standards.\n\n While Metro Manila remains the epicenter of infections, enforcement of quarantine rules is a \"national policy now,” said President Rodrigo Duterte's spokesman, Harry Roque.\n\n “It is a directive issued by the DILG, which must be implemented by the PNP nationwide, but particularly in areas where there are noted increase in COVID cases,” Roque said in a press briefing.\n\n Most local governments have ordinances which set penalties on the violation of COVID-19 protocols, said Roque.\n\n “Habang dumadami ang kaso ng COVID-19 ngayon, mas importante po na maipatupad natin itong minimum health standard para sa indibidwal, para sa mga establishments at siyempre yung pagtugon ng mga LGUs sa kanilang mga katungkulan,” he said.\n\n (While cases of COVID-19 are increasing, it is more important to implement minimum health standards for the individual, establishments, and of course the response of LGUs to their obligation.)\n\n Metro Manila authorities have coordinated with the police to help barangay officials implement curfew hours meant to slow the spread of COVID-19, said Parañaque Mayor Edwin Olivarez.\n\n \"We have to remind iyon pong discipline sa tao... Naka-one year na po tayo kaya parang nagkaroon na po ng fatigue ang tao doon sa ating ipinapa-implement,\" said Olivarez, who is also chairman of the Metro Manila Council.\n\n (We have to remind people of discipline. We have been in lockdown for a year so people are experiencing fatigue with what we implement.)\n\n The Philippines on Thursday recorded 3,749 new coronavirus infections, the highest daily increase in cases in nearly 6 months. The health department said total confirmed cases were at 607,048, while deaths reached 12,608.\n\n Authorities have warned the public not to be complacent and practice physical distancing to avoid the spread of the virus accelerating further.\n\n"}, {"title": "Minor side effects reported by small percentage of vaccinated health workers: DOH", "datetime": "Mar 12 03:14 PM", "author": "Kristine Sabillo, ABS-CBN News", "article": "MANILA — Some 1,000 health workers have reported minor side effects after inoculations against COVID-19, the Department of Health (DOH) said Friday, as the government races to vaccinate more health and essential workers.\n\n Philippines has so far vaccinated 114,615 health workers as of March 10, and \"a total of 978 suspected adverse events\" have been reported after immunization, said Health Undersecretary Maria Rosario Vergeire.\n\n “Dito sa 978, (a total of) 892 are from the CoronaVac or from the Sinovac,” she added.\n\n Majority or 872 of those side effects that happened after the use of Sinovac vaccines are “non-serious” while 20 cases are considered serious Adverse Event Following Immunization (AEFIs).\n\n For AstraZeneca, 85 recipients reported minor adverse events following immunization, and only one reported a serious side effect, Vergeire said.\n\n Among the common mild effects reported were muscle pain, pain on the injection site, body pains, fever and rashes, she said.\n\n Vergeire added that some of the patients who experienced these were given medicine and immediately recovered and went home. All were observed for 15 or 30 minutes after vaccination for possible side effects.\n\n “Usual lang po yan. Hindi po dapat ikatakot,” Vergeire said, adding that these are the same side effects experienced by children who are vaccinated.\n\n (These are usual side effects and should not be a cause of fear.)\n\n “Meron pong mga serious side effects or adverse events na mga nangyayari kung saan ang mga kababayan natin yung iba nahihirapang huminga. Yung iba ay may sumakit ang dibdib. Ito po ay kinoconsider natin na serious at pinag-aaralan po kung ano ang causality nito,” she said.\n\n (There are also serious side effects of adverse events that happened where some of our patients had trouble breathing. There were some who had chest pains. These are considered serious and we are studying the cause.)\n\n Vergeire said the head of the National Adverse Events Following Immunization Committee or NAEFIC believes that some of the reported cases can be attributed to anxiety.\n\n “Alam niyo po yung takot ng ating mga kababayan pag magpapabakuna. Baka sila magkaside effect o natakot sa karayom,” she said.\n\n (You know how some Filipinos are scared of being vaccinated. Maybe they are also scared of having side effects or they are scared of the needle.)\n\n The World Health Organization defines AEFI as “any untoward medical occurrence which follows immunization and which does not necessarily have a causal relationship with the usage of the vaccine.”\n\n In the WHO’s Global Manual on Surveillance of Adverse Events Following Immunization, there are different categorizations of AEFI. This includes vaccine product-related reaction, vaccine quality defect, immunization error, immunization anxiety, and coincidental events.\n\n The Philippines has received 600,000 Sinovac doses as a donation from China. It also received 525,600 AstraZeneca doses from the vaccine-sharing initiative COVAX Facility.\n\n"}, {"title": "Palace: IATF orders full use of COVID-19 contact-tracing app in 10 days", "datetime": "Mar 12 02:45 PM", "author": "Jamaine Punzalan, ABS CBN News", "article": "MANILA — The inter-agency task force leading the country's pandemic response has ordered the \"full implementation\" of the national government's contact-tracing app within 10 days, Malacañang said on Friday, as COVID-19 cases spiked in the Philippines.\n\n The IATF in December had required all establishments to adopt the Stay Safe contact-tracing app. But Palace spokesman Harry Roque said on Thursday remained the weakest point in the country's COVID-19 response, and that StaySafe was not in full use.\n\n “Wala na pong problema sa StaySafe app. As of yesterday, lahat ng gusot nai-plantsa na. Full implementation of StaySafe app within 10 days,” Roque said in a press briefing.\n\n (The StaySafe app no longer has problems. As of yesterday, all glitches have been ironed out. There will be full implementation of StaySafe app within 10 days.)\n\n Local governments who have been using their own contact-tracing apps should make sure that these have “inter-operability or compatibility” with StaySafe, he said.\n\n Authorities should ideally find 30 to 37 people who had close interaction with a patient who tests positive for the novel coronavirus, contact-tracing czar and Baguio Mayor Benjamin Magalong earlier said.\n\n “Iyong ating pinapaigting pa na (our intensified contact-tracing ratio of) 1:36 Magalong formula will now be implemented on a nationwide basis by StaySafe,” said Roque. \r\n \r\n“Talagang wala na pong pagbabago d'yan. We will implement StaySafe once and for all,” he added.\n\n (There will be no change there.)\n\n The Philippines on Thursday recorded 3,749 new coronavirus infections, the highest daily increase in cases in nearly 6 months. The health department said total confirmed cases were at 607,048, while deaths reached 12,608.\n\n Authorities have warned the public not to be complacent and practice physical distancing to avoid the spread of the virus accelerating further.\n\n — With a report from Reuters\n\n"}, {"title": "Campaigning for 2022? Duterte focused on COVID-19 crisis, says spokesman", "datetime": "Mar 12 02:30 PM", "author": "Jamaine Punzalan, ABS CBN News", "article": "MANILA— President Rodrigo Duterte is focused on the COVID-19 pandemic, Malacañang said on Friday, after the Chief Executive floated possible candidates in the 2022 elections.\n\n In a speech on Thursday, Duterte said his former longtime aide Sen. Christopher Go wants to be President. Duterte also said his chief legal counsel Salvador Panelo \"would make a good senator someday.\"\n\n Duterte's comment on Go was a joke, said Palace spokesman Harry Roque. The senator made the same statement on Thursday.\n\n \"Palagi naman pong nagbibiro ang Presidente para merong light moment,\" said Roque.\n\n (The President is always joking so that there is a light moment.)\n\n \"Nakatutok ang Presidente dito sa ating pagbabakuna... Ang primary thrust pa rin ng gobyerno is this pandemic,\" he added.\n\n (The President is focused on our vaccination... The primary thrust of the government is still this pandemic.)\n\n All members of the Duterte Cabinet, he said, \"were given the mandate to go and support the vaccination program of the government.\"\n\n Duterte's remarks came on the same day news broke that his party, PDP-Laban, was asking him to run for Vice President in 2022, when his term as chief executive ends.\n\n Go belongs to the same party.\n\n Duterte, in a speech last week, called Go \"President,\" seemingly in jest.\n\n KIDDING?\n\n Go, whose term in the Senate lasts until 2025, said the President's latest comment was just a joke.\n\n \"Salamat po sa tiwala pero alam naman po ng Pangulo na hindi talaga ako interesado. Biro lang ng Pangulo iyon,\" he said in a statement.\n\n (Thank you for the trust, but the President knows that I'm really not interested. That just a joke of the President.)\n\n However, Go said, \"Magbabago lang siguro ang isip ko kung tatakbong Vice President si Pangulong Duterte.\"\n\n (My mind might only change is President Duterte will run as vice president.)\n\n Duterte campaigned for Go during the 2019 Senate race that saw the defeat of all candidates from the opposition slate Otso Diretso.\n\n The Senate neophyte went straight to a national position on his first election bid. While now a lawmaker, he continues to be seen on the President's side in his official events.\n\n Go also features prominently on state TV's Laging Handa briefing, the only lawmaker with regular appearances there.\n\n Recently, he was the one who made major announcements related to the arrival of COVID-19 vaccines in the country, ahead of confirmations by the vaccine czar himself.\n\n The Chief Executive has said in multiple occasions that his daughter Davao City Mayor Sara Duterte-Carpio would not seek to succeed him in the 2022 elections.\n\n Duterte said women are not fit to be President.\n\n He also said Vice President Leni Robredo can't be Chief Executive, though she has not revealed plans for the 2022 race. Robredo is the leader of the opposition.\n\n The President's spokesman Harry Roque, meanwhile, accused Robredo of politicking, an allegation that her spokesman Barry Gutierrez fired back at Duterte's allies.\n\n"}, {"title": "LGUs must quarantine COVID-19 patients, contacts within 24 hours: IATF", "datetime": "Mar 12 02:21 PM", "author": "ABS-CBN News", "article": "MANILA — The inter-agency task force leading the country's pandemic response on Friday ordered local governments to quarantine people who are likely infected with COVID-19 and their close contacts, to curb increasing coronavirus infections.\n\n In a resolution published on the Official Gazette, the IATF said local governments must accomplish the following.\n\n The IATF also ordered the full implementation of the contact-tracing app StaySafe within 10 days, Palace spokesman Harry Roque said in a press briefing.\n\n The Philippines on Thursday recorded 3,749 new coronavirus infections, the highest daily increase in cases in nearly 6 months. The health department said total confirmed cases were at 607,048, while deaths reached 12,608.\n\n Authorities have warned the public not to be complacent and practice physical distancing to avoid the spread of the virus accelerating further.\n\n — With a report from Reuters\n\n"}, {"title": "Pacquiao warns Cusi: Do not divide PDP-Laban", "datetime": "Mar 12 02:16 PM", "author": "Katrina Domingo, ABS-CBN News", "article": "MANILA (UPDATE) - PDP-Laban president Sen. Manny Pacquiao on Friday warned Energy Secretary Alfonso Cusi not to \"poison\" and \"divide\" the minds of the ruling party's members amid talk of the group's lineup for the 2022 presidential elections despite the continuing COVID-19 pandemic.\n\n Cusi is allegedly among PDP-Laban members who have been going around the country to push Sen. Christopher \"Bong\" Go and President Rodrigo Duterte to run for president and vice president, respectively.\n\n \"Si Cusi naman, hindi ako nakikipagaway sa iyo [pero] hindi ako ang tao na puwede mo lang laru-laruin,\" Pacquiao said in a press conference.\n\n (As for Cusi, I am not quarreling with you but I am not the person you can toy with.)\n\n \"Kung umiikot ka, pulitika pinaguusapan mo, 'wag mo lasunin ang mga utak ng mga miyembro ng partido para magkahiwa-hiwalay,\" he said.\n\n (If you are going around the country, talking about politics, do not poison the minds of the party members and sow division.)\n\n \"Warning lang ito. Hindi ako nakikipagaway sa iyo. Gusto ko makipagkaibigan sa iyo,\" said the boxer-turned-lawmaker.\n\n (This is just a warning. I am not quarreling with you. I want to befriend you.)\n\n Pacquiao reminded the energy secretary not to walk back on his earlier statement that PDP-Laban should prioritize the COVID-19 pandemic over politics.\n\n \"Sabi mo 'wag muna pulitka, tulong muna sa tao... 'Yung salita mo, paninindigan mo. 'Wag mong kainin 'yung salita mo,\" Pacquiao said when asked to comment on Cusi, who sits as the party's vice chairman.\n\n (You said the people should be the priority and not politics... You should stick to your word. Do not eat what you said.)\n\n Earlier this week, several PDP-Laban members signed a resolution pushing for Duterte to run for Vice President in 2022, citing the need for the \"continuity of the Government’s 10-point Socioeconomic Agenda.\"\n\n On the same day, Duterte said his long-time ally Sen. Bong Go wants to become President. The latter said the president was just joking, but added he would only run if Duterte seeks the vice presidency.\n\n Pacquiao said the resolution is not official.\n\n \"Hindi legitimate 'yung resolution na ginawa. Nalaman ko lang 'yun dahil sinabi sa'kin ng tao ko,\" he said.\n\n (The resolution is illegitimate. I only knew about it because one of my staff told me.)\n\n PDP-Laban members who would continuously defy the order to refrain from talking about the 2022 national elections at this time would be \"dealt with,\" Pacquiao said.\n\n \"Karapatan ko na aksyunan ano man ang ginagawa ng lahat ng miyembro ng partido. Karapatan kong ituwid kung ano man ang mali,\" he said.\n\n (It is my right to sanction the activities of party members. It is my right to correct any mistake.)\n\n \"Napakaaga pa. Ang pag-usapan natin tulong dahil maraming tao ang magugutom,\" he said.\n\n (It is still too early. We should talk about helping others because a lot of people would go hungry.)\n\n CUSI SAYS NOT BEHIND DUTERTE-FOR-VP CALL\n\n Cusi, meanwhile, belied allegations he was sowing division within the party, saying the matter of Duterte possibly running as vice president next year was brought up by participants of the party's consultative assemblies in Manila, Cebu and Davao.\n\n \"This is the collective sentiment of the leaders on the ground. It did not come from me,\" Cusi said in a statement released hours after Pacquiao's press conference.\n\n \"I am just one member and the decision should be a collective action of the whole. This should be the guiding principle too in the choice of our party officers,\" he said.\n\n Pacquiao became PDP-Laban president in December 2020, while House Speaker Lord Allan Velasco was installed as acting executive vice president.\n\n This is the second time PDP-Laban was embroiled in allegations of infighting months before an election.\n\n In 2018, a group from Mindanao claiming to be party members held an event at the Quezon Memorial Circle criticizing then PDP-Laban Secretary General Pantaleon Alvarez.\n\n RELATED VIDEO\n\n"}, {"title": "Plebisito para sa paghahati sa Palawan, kasado na", "datetime": "Mar 12 02:14 PM", "author": "ABS-CBN News", "article": "Polling booths-in-waiting. #PalawanPleb pic.twitter.com/WJUR8TKnH1\n\n \n\n MAYNILA - Handang-handa na ang Commission on Elections (Comelec) sa pagsasagawa ng plebisito sa Marso 13 para sa panukalang paghahati sa Palawan sa tatlong probinsiya.\n\n “All systems go na po tayo. Actually ngayon nagkakaroon ng early withdrawal ng mga supplies para sa mga island municipalities at kinukuha na mga election paraphernalia ngayon,” pahayag ni James Jimenez, tagapagsalita ng Comelec.\n\n Sa panayam sa TeleRadyo Biyernes ng umaga, sinabi ni Jimenez na isa sa makikita muli ng mga botante sa mga polling precinct ay ang pagkakaroon ng polling booths.\n\n “For the first time in a very long time magkakaroon tayo ng polling booths para isolated pa rin sila kahit sila ay bumoboto and then after that sila ay magi-indelible ink at aalis na po.\n\n Pero bago pa man makaboto, kailangang masagutan muna nila nang mas maaga ang health declaration form bago pumunta sa polling precinct.\n\n “Kung wala silang na-fillout ahead of time, meron naman health declaration form doon so kailangan pa rin nilang mag-accomplish nun. Pag na-accomplish na nila 'yun, pwede silang magtungo doon sa tinatawag nating voters assistance desk,” sabi ni Jimenez.\n\n Dito, tutulungan sila ng mga volunteers para malaman kung saang presinto at anong kuwarto sila naka-assign sa mismong botohan. Pagpunta sa polling place, kukuha ng balota pero kailangang dumaan muna sa health screening.\n\n “Magkakaroon ng temperature check at titingnan kung sila ay walang sintomas ng COVID-19. Kapag sila ay may iprinesentang sintomas o ‘di kaya mataas ang temperatura nila, sila ay dadalhin sa tinatawag na isolation polling place o IPP at doon po sila makakaboto,” paliwanag niya.\n\n Nasa mga 5 katao lamang ang papayagan sa loob ng polling precinct para masunod pa rin ang physical distancing.\n\n Sa Sabado, Marso 13, gaganapin ang plebisito kung saan boboto ng \"Yes\" o \"No\" ang mga Palaweños sa paghahati ng Palawan sa tatlong probinsiya ng Palawan del Norte, Palawan Oriental, at Palawan del Sur. \r\n \r\nNasa kabuuang 490,639 ang registered voters ng Palawan na maaring lumahok sa plebisito.\n\n"}, {"title": "NBI: Flight attendant Dacera's companions liable for reckless imprudence, perjury", "datetime": "Mar 12 12:56 PM", "author": "ABS-CBN News", "article": "MANILA (3RD UPDATE) - The National Bureau of Investigation (NBI) on Friday filed several criminal charges against companions of flight attendant Christine Dacera at the Makati hotel where she had spent her final hours.\n\n The NBI Death Investigation Division filed obstruction of justice charges against Mark Rosales, Rommel Galido, John Dela Serna, Gregorio De Guzman, Jezreel Rapinan, Alain Chen, Reymay Englis, and Darwin Macalla, who partied with Dacera at the City Garden Grand Hotel in Makati City prior to her death on New Year's Day.\n\n The NBI said they were charged for “giving false or fabricated information to mislead or prevent the law enforcement agencies from apprehending the offenders.”\n\n The NBI also filed an obstruction of justice charge against their legal counsel Neptali Maroto, and found evidence to recommend charges of reckless imprudence resulting in homicide against Dela Serna, Rapinan, Chen, and Louie De Lima.\n\n In a press conference Friday, Zylykha Marie Corales Deramo of the NBI said that while the occupants of room 2209 did not intend to kill Dacera, they lacked \"proper diligence and prudence\" when Dacera had already been experiencing weakness that ultimately led to her death.\n\n As they partied, occupants of room 2207, where Dacera, 23, had stayed momentarily, allegedly went to 2209 to tell her companions that she was vomiting and experiencing a headache.\n\n Her companions supposedly downplayed this.\n\n “Kung ako nakikita ko ang aking kaibigan na nagsusuka, masakit ang ulo, gagawin ko bibigyan ko ng gamot or seek immediate assistance,” Deramo said.\n\n (If I see my friend vomiting, having headaches, I will give them medicine or seek immediate assistance.)\n\n She said Dacera complained to those in room 2207, who she just met that night, that she was feeling numb and breathless.\n\n Deramo continued: \"Dahil sa kakaunting panahon na kasama ni Tin ang occupants ng Room 2207 ay nakita nila na humihingal at nahihrapang huminga, nagsabing numb ang kanyang katawan. And yet 'yung occupants ng room 2209 who were with her for such a long time failed to observe the littlest of these details, which to us is very impossible.\"\n\n (In the short time Dacera was with the occupants of Room 2207, they saw her panting and having a hard time breathing, she even said that her body was feeling numb. And yet, the occupants of Room 2209, who were with her for such a long time failed to observe the littlest of these details, which to us is very impossible.)\n\n She added: “You did not intend to kill anybody but the omission to the proper diligence and prudence at that time and place… You are liable in the law kaya namin sila kinasuhan.\"\n\n NBI also found evidence to recommend reckless imprudence resulting in homicide against Dela Serna, Rapinan, Chen & Delima pic.twitter.com/LT5uYeK74E\n\n \n\n The NBI also recommended filing perjury charges against Galido, Dela Serna and Macalla.\n\n Rosales and Galido are, meanwhile, facing illegal drug charges after the NBI investigation showed that both Rosales and Galido allegedly tried to deliver or give away illegal drugs at the New Year party. Rosales is also facing a separate charge for allegedly introducing the party drugs to his companions.\n\n \"There was presence of dangerous drugs, fluoromethamphetamine 'yung suka doon sa room 2209. We have testimonial pieces of evidence and then itong forensic report ng SOCO, and then mayroon din itong (there is this) testimony galing kay (from) Jake Esperon that he was offered illegal drugs and it was also testified that Mark showed him powdered drugs. He pulled the powdered drugs from his socks,\" NBI Spokesperson Ferdinand Lavin said at the briefing.\n\n The NBI also filed falsification of public documents charges against Southern Police District Medico Legal Officer Police Maj. Michael Sarmiento, who conducted the autopsy on Dacera.\n\n Dacera was found unconscious and without a pulse in a bathtub at the Makati hotel around 12:30 p.m. on January 1 after a night of partying. Her friends said they tried to revive her and brought her to the Makati Medical Center, where she was later declared dead.\n\n Dacera and her friends had booked Room 2209 at City Garden Grand Hotel in Makati City to ring in the New Year. According to CCTV footage, they went back and forth to Room 2207 after being introduced to guests there.\n\n The PNP, in a medico-legal report, said Dacera died of natural causes, ruling out that her death on New Year’s day was a crime after initially suspecting rape and homicide against her companions. This was later on refuted by her family.\n\n The NBI also said Dacera’s friends did not give their statements despite multiple attempts for a request.\n\n However, they can still explain their side with the fiscal.\n\n ABS-CBN News also tried to seek the side of those facing charges, but they declined to give a statement pending the copy of the case filed by the NBI. — reports from Niko Baua and Angela Coloma, ABS-CBN News\n\n"}, {"title": "Malakihang operasyon laban sa COVID-19 protocol violators, isinagawa sa QC", "datetime": "Mar 12 12:46 PM", "author": "ABS-CBN News", "article": ""}, {"title": "Sinas 'in high spirits' despite COVID-19 diagnosis— PNP spox", "datetime": "Mar 12 12:34 PM", "author": "ABS-CBN News", "article": "MANILA— Philippine National Police chief Gen. Debold Sinas remains \"in high spirits\" despite testing positive for COVID-19, his spokesman said Friday.\n\n \"He's still in high spirits. Okay pa rin naman po siya. Asymptomatic naman po siya (He's fine. He's asymptomatic),\" PNP spokesperson Brig. Gen. Ildebrandi Usana told Teleradyo.\n\n The PNP on Thursday announced that Sinas had contracted the virus. He has volunteered to be confined at the Kiangan treatment facility in Camp Crame.\n\n Usana said Police Lt. Gen. Guillermo Eleazar, deputy chief for administration of PNP, would serve as the organization's officer-in-charge.\n\n In a statement, Sinas apologized for the \"relapse in the observance of mandatory health protocols.\"\n\n He was in Mindoro when he received his COVID-19 test results. In the past week, he also attended several events in the police headquarters such as the unveiling of a new monument, and the oath-taking and donning of newly promoted police officers.\n\n Last year, the then Metro Manila police director was charged for allegedly violating health protocols for holding a \"mañanita\" or dawn serenade for his 55th birthday celebration.\n\n Despite public backlash, President Rodrigo Duterte cleared Sinas of any violation of COVID-19 rules.\n\n In the interview, Usana said they were also waiting for additional COVID-19 vaccines to be administered to their frontline workers.\n\n So far, the PNP has received about 1,200 doses from the national government, he said. These were used to inoculate police officers working in the health service.\n\n To date, the PNP has logged 12,001 coronavirus infections, of which 11,217 recovered while 32 died. It currently has 752 patients deemed infectious or active cases.\n\n RELATED VIDEO\n\n"}]